app/Models/AttendanceModel.php

SELECT *
FROM `tblevents`
---
    public function get_data($tablename,$param){

        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblparticipants.event');
        $builder->where($param);
        $query   = $builder->get();

SELECT *
FROM `tblattendance`
JOIN `tblparticipants` ON `tblparticipants`.`regnumber` = `tblattendance`.`regnumber`
JOIN `tblsector` ON `tblsector`.`sectorid` = `tblparticipants`.`sector`
JOIN `refregion` ON `refregion`.`regCode` = `tblparticipants`.`address_region`
JOIN `refprovince` ON `refprovince`.`provCode` = `tblparticipants`.`address_province`
JOIN `tblevents` ON `tblevents`.`shorthand` = `tblattendance`.`event`
WHERE `tblattendance`.`event` = 'mando'
---
    public function get_attendance_list($tablename,$param){

        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblparticipants', 'tblparticipants.regnumber = tblattendance.regnumber');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblattendance.event');

        if ($param['event'] != 'all' && $param['event'] != '') {
            $builder->where('tblattendance.event',$param['event']);
        }
        $query = $builder->get();