app/Models/ParticipantsModel.php

    public function get_attendance_list($tablename){

        $builder = $this->db->table($tablename);
        $builder->select('tblparticipants.participantid, tblparticipants.regnumber, tblparticipants.fullname, tblparticipants.contactno, tblparticipants.email, tblparticipants.position, tblparticipants.agency_name, tblparticipants.sex, tblparticipants.privileges,tblattendance.date_registered');
        $builder->join('tblattendance', 'tblattendance.regnumber = tblparticipants.regnumber');
        $query = $builder->get();
---
SELECT `tblparticipants`.`participantid`, `tblparticipants`.`regnumber`, `tblparticipants`.`fullname`, `tblparticipants`.`contactno`, `tblparticipants`.`email`, `tblparticipants`.`position`, `tblparticipants`.`agency_name`, `tblparticipants`.`sex`, `tblparticipants`.`privileges`, `tblattendance`.`date_registered`
FROM `tblparticipants`
JOIN `tblattendance` ON `tblattendance`.`regnumber` = `tblparticipants`.`regnumber`